# Q8. Consider the following data frame containing a family name, gender of the family member and her/his monthly income in each record

In [10]:
import numpy as np
import pandas as pd

df = pd.read_csv('F:\CS\sem 5\Data Analysis and Visualisation\Practicals/family_data8.csv')
df

    Name  Gender  Monthly Income (Rs.)
0   Shah    Male                114000
1   Vats    Male                 65000
2   Vats  Female                 43150
3  Kumar  Female                 69500
4   Vats  Female                155000
5  Kumar    Male                103000
6   Shah    Male                 55000
7   Shah  Female                112400
8  Kumar  Female                 81030
9   Vats    Male                 71900

## a. Calculate and display familywise gross monthly income.

In [13]:
df.groupby('Name')['Monthly Income (Rs.)'].sum()

Name
Kumar    253530
Shah     281400
Vats     335050
Name: Monthly Income (Rs.), dtype: int64

## b. Calculate and display the member with the highest monthly income in a family.

In [12]:
df1 = pd.DataFrame(df.groupby('Name')['Monthly Income (Rs.)'].max())
df1

       Monthly Income (Rs.)
Name
Kumar                103000
Shah                 114000
Vats                 155000

## c. Calculate and display monthly income of all members with income greater than Rs. 60000.00.

In [14]:
df[df['Monthly Income (Rs.)'] > 60000]

    Name  Gender  Monthly Income (Rs.)
0   Shah    Male                114000
1   Vats    Male                 65000
3  Kumar  Female                 69500
4   Vats  Female                155000
5  Kumar    Male                103000
7   Shah  Female                112400
8  Kumar  Female                 81030
9   Vats    Male                 71900

## d. Calculate and display the average monthly income of the female members in the Shah family.

In [15]:
df[(df['Name'] == 'Shah') & (df['Gender'] == 'Female')]['Monthly Income (Rs.)'].mean()

112400.0